In [38]:
%matplotlib

Using matplotlib backend: MacOSX

In [39]:
# Dependencies
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
from passwords import password
import numpy as np

In [40]:
# Import the SQL database into Pandas
engine = create_engine('postgresql://postgres:' + password + '@localhost:5433/SQL - Homework')
connection = engine.connect()

In [41]:
salaries_data = pd.read_sql('SELECT * FROM salaries', connection)
salaries_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [55]:
# Create histogram of common salary ranges for employees
salaries_data.hist(column='salary', grid=0)
plt.title('Common Salary Ranges for Employees')
plt.xlabel('Salary')
plt.ylabel('Frequency')

# Save fig
plt.savefig('../Employee_Bonus/Common_Salary_Ranges_for_Employees.png')

In [43]:
# Read in title data
title_data = pd.read_sql('SELECT * FROM titles', connection)
title_data = title_data.rename(columns={'title_id':'emp_title_id'})
title_data

  emp_title_id               title
0        s0001               Staff
1        s0002        Senior Staff
2        e0001  Assistant Engineer
3        e0002            Engineer
4        e0003     Senior Engineer
5        e0004    Technique Leader
6        m0001             Manager

In [44]:
# Read in employees data needed
employees_data = pd.read_sql('SELECT emp_no, emp_title_id FROM employees', connection)
employees_data.head()

   emp_no emp_title_id
0  473302        s0001
1  475053        e0002
2   57444        e0002
3  421786        s0001
4  282238        e0003

In [45]:
# Merge employees and salaries
merged_data = pd.merge(employees_data, salaries_data, on='emp_no').groupby('emp_title_id').mean()
merged_data

                     emp_no        salary
emp_title_id
e0001         252992.595373  48564.434447
e0002         253654.345919  48535.336511
e0003         253038.749885  48506.799871
e0004         251811.432730  48582.896092
m0001         110780.833333  51531.041667
s0001         253408.503604  58465.382850
s0002         254481.798969  58550.172704

In [46]:
# Merge titles to get employee title
final_merge = pd.merge(title_data, merged_data, on='emp_title_id')
final_merge

  emp_title_id               title         emp_no        salary
0        s0001               Staff  253408.503604  58465.382850
1        s0002        Senior Staff  254481.798969  58550.172704
2        e0001  Assistant Engineer  252992.595373  48564.434447
3        e0002            Engineer  253654.345919  48535.336511
4        e0003     Senior Engineer  253038.749885  48506.799871
5        e0004    Technique Leader  251811.432730  48582.896092
6        m0001             Manager  110780.833333  51531.041667

In [47]:
# Drop unwanted rows
data = final_merge.drop(['emp_title_id', 'emp_no'], axis=1)
data

                title        salary
0               Staff  58465.382850
1        Senior Staff  58550.172704
2  Assistant Engineer  48564.434447
3            Engineer  48535.336511
4     Senior Engineer  48506.799871
5    Technique Leader  48582.896092
6             Manager  51531.041667

In [53]:
# Set x_axis, y_axis & Tick Locations
x_axis = data["title"]
ticks = np.arange(len(x_axis))
y_axis = data["salary"]
 
# Create Bar Chart Based on Above Data
plt.bar(x_axis, y_axis, align="center", alpha=0.5, color=["m", "b", "g", "y", "k", "c", "r"])

# Create Ticks for Bar Chart's x_axis
plt.xticks(ticks, x_axis, rotation='vertical')

# Set Labels & Title
plt.ylabel("Salaries ($)")
plt.xlabel("Employee Titles")
plt.title("Average Employee Salary by Title")

# Show plot
plt.show()

# Save Figure
plt.savefig("../Employee_Bonus/Average_Salary_by_Title.png")